In [1]:
%matplotlib inline
import pandas as pd
import numpy as np

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

FileNotFoundError: [Errno 2] No such file or directory: 'style-table.css'

In [3]:
titles = pd.read_csv('D:/letsupgrade/data/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [4]:
re=pd.read_csv("D:/letsupgrade/data/release_dates.csv")
re.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

In [5]:
cast=pd.read_csv("D:/letsupgrade/data/cast.csv")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [6]:
len(titles)

244914

### What are the earliest two films listed in the titles dataframe?

In [7]:
titles.sort_values(by='year',na_position='last').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [8]:
len(cast[cast["title"]=="Hamlet"])

342

### How many movies are titled "North by Northwest"?

In [9]:

len(cast[cast["title"] == "North by Northwest"])

116

### When was the first movie titled "Hamlet" made?

In [10]:
titles[titles.title == 'Hamlet'].sort_values(by="year").head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [11]:
titles[titles.title == "Treasure Island"].sort_values(by='year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [12]:
len(titles[titles.year == 1950])

1113

### How many movies were made in the year 1960?

In [13]:
len(titles[titles.year == 1960])

1549

### How many movies were made from 1950 through 1959?

In [14]:
len(titles[(titles.year >=1950)  & (titles.year<=1959)])

12934

### In what years has a movie titled "Batman" been released?

In [15]:
re[re["title"]=='Batman']

        title  year         country        date
39316  Batman  1943             USA  1943-07-16
39317  Batman  1943          Mexico  1946-11-01
39318  Batman  1943        Portugal  1950-05-29
39319  Batman  1943    West Germany  1966-06-19
39320  Batman  1989             USA  1989-06-23
39321  Batman  1989         Ireland  1989-08-11
39322  Batman  1989              UK  1989-08-11
39323  Batman  1989       Australia  1989-08-31
39324  Batman  1989         Belgium  1989-09-13
39325  Batman  1989          France  1989-09-13
39326  Batman  1989         Denmark  1989-09-29
39327  Batman  1989     Netherlands  1989-09-29
39328  Batman  1989        Portugal  1989-09-29
39329  Batman  1989           Spain  1989-09-29
39330  Batman  1989          Norway  1989-10-05
39331  Batman  1989          Taiwan  1989-10-07
39332  Batman  1989         Finland  1989-10-20
39333  Batman  1989           Italy  1989-10-20
39334  Batman  1989          Sweden  1989-10-20
39335  Batman  1989          Brazil  1989-10-26
39336  Batman  1989    West Germany  1989-10-26
39337  Batman  1989          Greece  1989-10-27
39338  Batman  1989       Hong Kong  1989-11-02
39339  Batman  1989      Yugoslavia  1989-11-21
39340  Batman  1989        Colombia  1989-11-23
39341  Batman  1989       Argentina  1989-12-14
39342  Batman  1989         Hungary  1989-12-21
39343  Batman  1989           Japan  1989-12-23
39344  Batman  1989         Uruguay  1989-12-25
39345  Batman  1989          Poland  1989-12-31
39346  Batman  1989           India  1990-03-13
39347  Batman  1989     South Korea  1990-07-07
39348  Batman  1989  Czechoslovakia  1992-05-01

### How many roles were there in the movie "Inception"?

In [16]:
cast[cast.title == "Inception"]

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3387147,Inception,2010,Ellen Page,actress,Ariadne,3.0
3444628,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3473041,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3480170,Inception,2010,Talulah Riley,actress,Blonde,25.0
3731263,Inception,2010,Shannon Welles,actress,Old Mal,51.0

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [17]:
len(cast[(cast["n"].isna()== True) & (cast['title'] == 'Inception')])

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [18]:
len(cast[(cast.title=='Inception') & (cast['n'].isna() == False)] )

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [19]:
cast[(cast['title'] == "North by Northwest") & (cast['n'].isna() == False) ].sort_values(by='n')

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [20]:
cast[(cast["title"] == "Sleuth") & (cast['year'] == 1972)].sort_values(by='n')

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [21]:
cast[(cast["title"] == "Sleuth") & (cast['year'] == 2007)].sort_values(by='n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [22]:
len(cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1921)])

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [23]:
len(cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1996)])

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [24]:
len(cast[(cast['title'] == 'Hamlet') ])

342

### How many people have played an "Ophelia"?

In [25]:
len(cast[(cast['title'] == 'Ophelia') ])

20

### How many people have played a role called "The Dude"?

In [26]:
len(cast[cast['character'] == 'The Dude' ])

19

### How many people have played a role called "The Stranger"?

In [27]:
len(cast[cast['character'] == 'The Stranger' ])

212

### How many roles has Sidney Poitier played throughout his career?

In [28]:
len(cast[cast['name'] == 'Sidney Poitier' ])

43

### How many roles has Judi Dench played?

In [29]:
len(cast[cast['name'] == 'Judi Dench' ])

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [30]:
cast[(cast['name'] == 'Cary Grant') & (cast['n'] ==2)  & (cast['year'] >= 1940) & (cast['year'] <=1949)].sort_values(by='year')

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [31]:
cast[(cast['name'] == 'Cary Grant') & (cast['n'] ==1)  & (cast['year'] >= 1940) & (cast['year'] <=1949)].sort_values(by='year')

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [32]:
len(cast[(cast['type'] == 'actor') & (cast['year'] >= 1950) & (cast['year'] <=1959)])

157738

### How many roles were available for actresses in the 1950s?

In [33]:
len(cast[(cast['type'] == 'actress') & (cast['year'] >= 1950) & (cast['year'] <=1959)])

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [34]:
len(cast[(cast['year']<=1980) & (cast['n'] == 1)])

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [35]:
len(cast[(cast['year']<=1980) & (cast['n']>1)])

669320

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [36]:
len(cast[(cast['year']==1980) & (cast['n'].isna())])

4466